app/controllers/clients_controller.rb

  def index
    @clients = Client.all
---
SELECT * FROM `clients`

  def admin
    @clients = Client.all
---
SELECT * FROM `clients`

  def show
    @client = Client.find(params[:id])
    @clients = Client.all
---
SELECT * FROM `clients` WHERE (`clients`.`id` = 377)
SELECT * FROM `clients`

  def edit
    @client = Client.find(params[:id])
---
SELECT * FROM `clients` WHERE (`clients`.`id` = 939)

  def update
    @client = Client.find(params[:id])

    respond_to do |format|
      if @client.update_attributes(params[:client])
---
SELECT * FROM `clients` WHERE (`clients`.`id` = 939)
UPDATE `clients` SET `ticker` = '', `story` = '', `notes` = '', `description` = '<p>NaNoMojo is a new iPhone App developed by Netphase for the upcoming National Novel Writing Month competition. NaNoWriMojo helps NaNo participants keep up with their friends\' wordcounts, keeps them up-to-date on breaking NaNo News, and can even help write their book with the built-in thesaurus and dictionary!</p>', `updated_at` = '2009-10-02 18:21:25', `url` = 'http://netphase.com/nanomojo', `name` = 'NaNoMojo' WHERE `id` = 939