app/controllers/contacts_controller.rb

SELECT * FROM `contacts`
---
  def index
    @contacts = Contact.all

INSERT INTO `contacts` (`name`, `message`, `updated_at`, `url`, `referred_by`, `email`, `created_at`) VALUES('Chris Beck', 'I am buried in work!', '2009-09-17 04:24:11', 'http://www.netphase.com', 'web', 'chris.beck@me.com', '2009-09-17 04:24:11')
---
  def create
    @contact = Contact.new(params[:contact])

    respond_to do |format|
      if @contact.save