app/controllers/images_controller.rb

SELECT * FROM `images` WHERE (`images`.`id` = 1)
---
  def thumb
    @image = Image.find(params[:id])

SELECT * FROM `images` WHERE (`images`.`id` = 1)
---
  def small
    @image = Image.find(params[:id])

SELECT * FROM `images` WHERE (`images`.`id` = 1)
---
  def mini
    @image = Image.find(params[:id])

SELECT * FROM `images`
---
  def index
    @images = Image.all

SELECT * FROM `images` WHERE (`images`.`id` = 1)
---
  def edit
    @image = Image.find(params[:id])

INSERT INTO `images` (`name`, `updated_at`, `contributor`, `description`, `created_at`) VALUES('test image', '2009-10-19 20:40:34', 'chris', 'a test image', '2009-10-19 20:40:34')
---
  def create
    @image = Image.new(params[:image])

    respond_to do |format|
      if @image.save