app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`updated_at`, `title`, `body`, `created_at`) VALUES('2009-10-19 19:06:51', 'New News For You', 'Eat more chicken if you want, but this post thing was created in mere minutes. ', '2009-10-19 19:06:51')

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
UPDATE `posts` SET `body` = 'Eat more chicken if you want, but this post thing was created in mere minutes. \r\n\r\n<a href=\"/images/logo.png\"/>', `updated_at` = '2009-10-19 19:40:28' WHERE `id` = 1