app/controllers/services_controller.rb

  def index
    @services = Service.all
---
SELECT * FROM `services`